### Importing Libraries

In [4]:
# import libraries
import os
import pandas as pd
import numpy as np

### Get the dataset

In [4]:
# download dataset using kaggle api
# !pip install kaggle
import kaggle
!kaggle datasets download seanangelonathanael/bank-target-marketing -f "Bank Target Marketing Dataset.csv"

Dataset URL: https://www.kaggle.com/datasets/seanangelonathanael/bank-target-marketing
License(s): MIT
Downloading Bank%20Target%20Marketing%20Dataset.csv.zip to C:\Users\shrey\Documents\Data Analyst 101\Projects 101\The Final Attempt - Portfolio Projects\SQL Bank Target Marketing Analysis

  0%|          | 0.00/623k [00:00<?, ?B/s]
100%|##########| 623k/623k [00:01<00:00, 581kB/s]
100%|##########| 623k/623k [00:01<00:00, 581kB/s]

In [8]:
# rename the file to avoid errors
# os.rename("Bank%20Target%20Marketing%20Dataset.csv.zip", "data.csv.zip")

In [10]:
# extract data from zip file
import zipfile
zip_ = zipfile.ZipFile('data.csv.zip')
zip_.extractall()
zip_.close()

In [12]:
os.listdir()

['.ipynb_checkpoints',
 'Bank Target Marketing Dataset.csv',
 'data.csv.zip',
 'SQL Bank Target Marketing Analysis.ipynb']

In [13]:
os.rename('Bank Target Marketing Dataset.csv', 'data.csv')

## **Data Cleaning**
### Data Statistics

In [5]:
# read data
df = pd.read_csv('data.csv')
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
2,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes
3,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes
4,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes

In [6]:
df.sample(5)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
22844,39,management,single,tertiary,no,490,no,no,unknown,20,jun,44,3,-1,0,unknown,no
36413,58,management,divorced,tertiary,no,5037,yes,no,cellular,18,nov,1437,2,-1,0,unknown,yes
39532,26,unemployed,single,primary,no,1213,no,no,cellular,29,jan,685,1,-1,0,unknown,no
529,34,services,single,secondary,no,-30,no,no,cellular,21,jul,1360,3,-1,0,unknown,yes
32970,51,technician,married,secondary,no,180,yes,no,cellular,20,aug,154,2,-1,0,unknown,no

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56373 entries, 0 to 56372
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        56373 non-null  int64
 1   job        56373 non-null  object
 2   marital    56373 non-null  object
 3   education  56373 non-null  object
 4   default    56373 non-null  object
 5   balance    56373 non-null  int64
 6   housing    56373 non-null  object
 7   loan       56373 non-null  object
 8   contact    56373 non-null  object
 9   day        56373 non-null  int64
 10  month      56373 non-null  object
 11  duration   56373 non-null  int64
 12  campaign   56373 non-null  int64
 13  pdays      56373 non-null  int64
 14  previous   56373 non-null  int64
 15  poutcome   56373 non-null  object
 16  deposit    56373 non-null  object
dtypes: int64(7), object(10)
memory usage: 7.3+ MB

In [61]:
df.describe()

,age,balance,day,duration,campaign,pdays,previous
count,56373.000000,56373.000000,56373.000000,56373.000000,56373.000000,56373.000000,56373.000000
mean,40.994767,1395.193249,15.777039,280.701861,2.713267,42.402107,0.630266
std,10.887854,3082.058457,8.342159,281.253563,3.028980,101.990991,2.303356
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,81.000000,8.000000,108.000000,1.000000,-1.000000,0.000000
50%,39.000000,469.000000,16.000000,192.000000,2.000000,-1.000000,0.000000
75%,49.000000,1489.000000,21.000000,346.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [62]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'deposit'],
      dtype='object')

### Check for duplicate values

In [63]:
df.duplicated().sum()

11162

In [64]:
# remove duplicates
print(f'Size of the dataset initially: {df.shape}')
df.drop_duplicates(inplace=True)

print(f'Size of the dataset after removing duplicate values{df.shape}')

Size of the dataset initially: (56373, 17)
Size of the dataset after removing duplicate values(45211, 17)

### Check for null values

In [65]:
df.isna().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
deposit      0
dtype: int64

In [69]:
df.poutcome.unique()

array(['unknown', 'other', 'failure', 'success'], dtype=object)

Numerical Features: age, balance, day, duration, campaign, pdays, previous.

Categorical Features: job, marital, education, default, housing, loan, contact, month, poutcome,Y.

In [82]:
# rename df columns:

new_cols = {
'default': 'credit_default', 
'contact': 'contact_type', 
'day': 'contact_day', 
'month': 'contact_month', 
'campaign': 'contact_count'
}

df = df.rename(columns=new_cols)

In [83]:
df.head()

,age,job,marital,education,credit_default,balance,housing,loan,contact_type,contact_day,contact_month,duration,contact_count,pdays,previous,poutcome,deposit
0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
2,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes
3,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes
4,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes

## **Establish a SQL Connection**
### Load data in SQL server

In [76]:
# !pip install pymysql
# !pip install mysqlclient

import sqlalchemy as sal
from sqlalchemy import create_engine

hostname = 'localhost'
username = '****'
password = '****'
port = 3306
database = 'my_sql'

engine = create_engine('mysql+pymysql://' + username + ':' + password + '@' + hostname + ':' + str(port) + '/' + database)
conn=engine.connect()

### Connect the dataset to sql server

In [84]:
df.to_sql('bank_df', method=None, schema='my_sql', con=conn, index=False, if_exists='append')
conn.commit()